content/posts/2020_development_tools.md
+++
title = "Development Tools 2020"
date = 2019-12-16
lastmod = 2020-04-19T18:00:23-05:00
draft = true
weight = 2002
+++

I enjoy trying out new tools and environments so what I use for coding changes
constantly. I'd like to take sometime to catalog what I'm using currently as I'm
certain it will likely change over the coming months. I'll summarize the main
tools I use now and follow up with a detail overview of why these tools are
currently in my toolbox.

- Text editor: Emacs
- Task management: Org-mode
- OS: MacOS + Linux
- Chat: Teams

## Emacs {#emacs}

Why emacs? Extensibility. Over the past couple years i've went from VS Code to
VIM + TMux to Pycharm while dabbling here and there with emacs boilerplate
configs (doom/spacemacs). While I couldn't find myself being productive enough
to use it for my day job until recently I had always seen the potential. I was
an org-mode convert about a year ago and in that time I slowly became more
familiar with using emacs.

## Org-Mode {#org-mode}

The gateway drug into the emacs ecosystem. I've tried quitting in the past for
other GTD management systems but I always come back. It's not the prettiest
system but it just works. It's integration and extensibility are unmatched. My
conversion to using emacs for more than just task management was due to the
scope of this package alone.

## OS {#os}

MacOS during my day job and Linux at home. Particularly Arch. Like emacs I keep
coming back. I have a personal macbook pro that I've recently purchased but as I
continue to dive deeper into linux and the widespread support it not receives.
It's hard to use anything else. I have also become more and more frustrated with
the apple ecosystem. It's a fantastic OS for the average consumer but the
restrictions being put in place to protect people are becoming more and more
suffocating. I will still take MacOS as theres less tinkering to get a working
enviroment done but comparatively to any linux distro it's a pain in the ass to
customize and extend.

[//]: # "Exported with love from a post written in Org mode"
[//]: # "- https://github.com/kaushalmodi/ox-hugo"
